app/Controllers/Penjualan.php

    public function index() {
        $barangModel = new MasterBarangModel();
        $promoModel  = new PromoModel();
        $headerModel = new PenjualanHeaderModel();

        $data = [
            'title'      => 'Transaksi Penjualan',
            'barang'     => $barangModel->findAll(),
            'promo'      => $promoModel->findAll(),
            'penjualan'  => $headerModel->orderBy('tgl_transaksi', 'DESC')->findAll()
---
SELECT *
FROM `master_barang`
SELECT *
FROM `promo`
SELECT *
FROM `penjualan_header`
ORDER BY `tgl_transaksi` DESC

    public function getDetail($no_transaksi) {
        $detailModel = new PenjualanHeaderDetailModel();
        $data = $detailModel->where('no_transaksi', $no_transaksi)->findAll();
---
SELECT *
FROM `penjualan_header_detail`
WHERE `no_transaksi` = '202312-001'

    public function store() {
        $db = \Config\Database::connect();
        $db->transStart();

        $headerModel = new PenjualanHeaderModel();
        $detailModel = new PenjualanHeaderDetailModel();

        $no_transaksi = $this->request->getPost('no_transaksi');

        $headerModel->insert([
            'no_transaksi'  => $no_transaksi,
            'tgl_transaksi' => $this->request->getPost('tgl_transaksi'),
            'customer'      => $this->request->getPost('customer'),
            'kode_promo'    => $this->request->getPost('kode_promo'),
            'total_biaya'   => $this->request->getPost('total_biaya'),
            'ppn'           => $this->request->getPost('ppn'),
            'grand_total'   => $this->request->getPost('grand_total'),
        ]);
---
INSERT INTO `penjualan_header` (`no_transaksi`, `tgl_transaksi`, `customer`, `kode_promo`, `total_biaya`, `ppn`, `grand_total`) VALUES ('202604-001', '2026-04-22', 'aaa', 'promo-001', '42890', '4718', '47608')